/*********************************************************************/
// * \file   AreaAttackController.cs
// * \brief  範囲攻撃コントローラークラス
// *
// * \author 成田悠真
/*********************************************************************/

using UnityEngine;

/// <summary>
/// 範囲攻撃コントローラークラス
/// </summary>
public class AreaAttackController : AttackController
{
    //=====================================================================
    // 変数
    //=====================================================================

    [Header("範囲攻撃の設定")]

    [SerializeField]
    private AreaAttack areaAttack;

    //=====================================================================
    // 関数
    //=====================================================================

    protected override void StartAttack()
    {
        areaAttack.StartAttack();
    }
}
